Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/victims_of_crime/victims_and_the_law.html.txt.tmx
Source language: en
Languages: ga

source: Victims of crime and the law
ga: An dlí agus íospartaigh choireanna

source: The Department of Justice and Equality takes into account the views of victims when framing or reviewing criminal law
ga: Cuireann an Roinn Dlí agus Cirt agus Comhionannais tuairimí íobartach san áireamh nuair atá dlíthe dhá dhéanamh nó an dlí coiriúil le leasú

source: Some of the important laws that concern victims are set out in the Rules section below
ga: Tá cur síos ar chuid de na dlíthe tábhachtacha a bhaineann le íobartaigh san alt thíos faoi Rialacha

source: The Criminal Evidence Act, 1992
ga: Acht um Fhianaise Choiriúil, 1992

source: This Act makes it easier for witnesses to give evidence in physical or sexual abuse cases by allowing for a live television link with the court
ga: Tá sé níos éasca de bharr an Achta seo don fhinné fianaise a thabhairt i gcásanna mí-úsáid fisiciúil nó gnéis tríd nasc beo teilifíse leis an gcúirt a cheadú

source: In some cases, this Act forces the spouse of the accused to give evidence for the prosecution
ga: I gcásanna áirid, cuireann an tAcht seo iallach ar chéile an té atá cúisithe fianaise a chur ar fáil ar son na gciontóirí

source: The Act makes it easier for children to give evidence by getting rid of
ga: Tá sé níos éasca ag gasúir fianaise a thabhairt de bharr an Achta mar

source: • the need to give evidence on oath
ga: • níl aon ghá dóibh fianaise a thabhairt ar mhionn

source: • the need for corroboration (previously, additional evidence confirming the evidence given by the child was needed)
ga: • níl aon ghá le comhthacaíocht (roimhe seo, b'éigean fianaise eile le comhthacaíocht a thabhairt don fhianaise a thug an páiste a chur ar fáil)

source: • the wearing of wigs and gowns by barristers when evidence is being given by television links
ga: • ní chaitheann na habhcóidí bréagfhoilt agus róbaí nuair atá fianaise dhá thabhairt tríd nasc teilifíse

source: The Criminal Justice Act, 1993
ga: An tAcht um Dhlí Coiriúil, 1993

source: This Act forces the court to consider the effect of a violent or sexual offence on you when it is deciding the sentence
ga: Cuireann an tAcht seo iallach ar an gcúirt tionchar na coire foréigneach nó gnéis ar an íobartach a chur san áireamh nuair atá cinneadh dhá dhéanamh aici maidir leis an bpionós

source: If you are a victim of a violent or sexual offence, you are also entitled to give evidence in court about how the crime affected you
ga: Tá sé de cheart ag duine a bhí thíos le coir foréigneach nó gnéis, fianaise a thabhairt sa chúirt maidir leis an tionchar a bhí ag an gcoir air/uirthi

source: The Act allows the Director of Public Prosecutions to appeal lenient sentences and gives the court the power to force the offender to pay compensation to you for any personal injury or loss you suffered
ga: Tugann an tAcht seo cead do Stiúrthóir na nInchúisithe Poiblí achomharc a dhéanamh i gcás pionóis boig agus tugann sé cumhacht don chúirt iallach a chur ar an gciontóir cúiteamh a íoc leis an íobartach ar son aon ghortuithe phearsanta nó cailliúint a d'fhulaing sé/sí

source: The Civil Legal Aid Act, 1995
ga: An tAcht an Chúnamh Dlí Sibhialta 1995

source: Under this Act, the Legal Aid Board provides legal aid or advice to a complainant in certain criminal cases involving prosecution for a range of sexual offences, including rape, aggravated sexual assault and incest
ga: Faoin Acht seo, soláthraíonn an Bord um Chúnamh Dlíthiúil cúnamh dlíthiúil nó comhairle le gearánaí i gcásanna áirithe coiriúla a bhaineann le ionchúiseamh mar gheall ar raon cionta gnéis, lena n-áirítear éigniú, tromionsaí gnéasach agus ciorrú coil

source: A complainant is the person making the complaint
ga: Tá gearánach an duine a rinne an gearán

source: The Board also provides legal advice in relation to criminal matters to alleged victims of human trafficking
ga: Soláthraíonn an Bord freisin comhairle dlí i ndáil le nithe coiriúla a d'íospartaigh líomhnaithe gáinneála ar dhaoine

source: The Domestic Violence Act, 1997
ga: An tAcht um Fhoréigean Baile, 1996

source: This Act provides protection where there is a violent family member
ga: Forálann an tAcht seo a chosaint i gcás ina bhfuil ball teaghlaigh foréigneach

source: There are two main kinds of protection available, a safety order and a barring order
ga: Tá dhá príomhchineál cosanta le fáil, ordú sábháilteachta agus ordú urchoisc

source: A safety order prohibits the violent person from further violence or threats of violence
ga: Cuireann an ordú sábháilteachta cosc ar dhuine foréigneach ar fhoréigean breise nó ar bhagairt foréigin

source: It does not oblige the person to leave the family home
ga: Ní bhíonn iallach ar an duine áras an teaghlaigh a fhágáil

source: If the person lives apart from you it prohibits them from watching or being near your home
ga: Má chónaíonn sibh óna chéile tá cosc orthu ar fhaire a dhéanamh ar d’áras nó bheith cóngarach do d’áras

source: A barring order requires the violent person to leave the family home
ga: Éilíonn an ordú urchoisc ar an duine foréigneach áras an teaghlaigh a fhágáil

source: The order also prohibits the person from further violence or threats of violence, and from watching or being near your home
ga: Cuireann sé cosc ar an duine ar fhoréigean breise nó ar bhagairt foréigin, agus ar fhaire a dhéanamh ar d’áras nó bheith cóngarach do d’áras

source: Non-Fatal Offences Against the Person Act, 1997
ga: An tAcht um Chionta Neamh-Mharfacha in aghaidh an Duine, 1997

source: This Act has updated and modernised the existing law relating to various forms of assault, threats to kill or cause serious harm, poisoning, false imprisonment and abduction of children
ga: Thug an tAcht seo an reachtaíocht a bhí ann maidir le cineálacha eagsúla ionsaithe, bagairt maraithe nó gortaithe troim, nimhiú, príosúnacht neamhdhleathach agus fuadach páistí suas chun dáta

source: The Act has also introduced a number of new offences
ga: Tá roinnt coireanna nua curtha san áireamh ag an Acht freisin

source: The Act has measures dealing with
ga: Tá córas leagtha síos san Acht le deileáil le

source: • Offences relating to violence or threats of violence involving syringes and/or blood
ga: • Coireanna a bhaineann le foréigean nó le bagairt an fhoréigin tríd úsáid a bhaint as steallairí agus/nó fuil

source: • The offence of harassment, which is aimed at what is commonly known as "stalking"
ga: • Ciapadh, atá dírithe ar an rud ar a dtugtar "faire" go coitianta

source: • Debt collection with threats or menaces
ga: • Fiacha a bhailiú tríd úsáid a bhaint as bagairtí

source: • Poisoning or the administration of substances intended to interfere with bodily functions
ga: • Nimhiú nó foladh a thabhairt do dhuine a bhfuil sé i gceist cur isteach ar fheidhmiú an choirp leis

source: • The use of reasonable force in protecting yourself, your family and your property from criminal activity
ga: • Úsáid a bhaint as an lámh láidir go pointe réasúnta le thú féin, do theaghlach agus do mhaoin a chosaint ó choireanna coiriúla

source: The Bail Act, 1997
ga: An tAcht um Bhannaí, 1997

source: This Act tightened up the bail regime
ga: Chuir an tAcht seo srian leis an dlí a bhaineann le bannaí

source: Now a court may refuse bail to a person charged with a serious offence if it is likely that the person may commit another serious offence while he or she is on bail
ga: Is féidir leis an gcúirt anois diúltú duine atá cúisithe le coir throm a scaoileadh saor ar bhannaí má tá seans ann go ndéanfaidh an duine sin coir throm eile nuair atá sé/sí saor ar bhannaí

source: In addition, the Act requires a court to impose consecutive sentences when an offence is committed on bail
ga: Chomh maith leis sin cuireann an tAcht iallach ar an gcúirt téarmaí príosúin i ndiaidh a chéile a thabhairt do dhuine a chúisítear as coir throm eile a dhéanamh nuair atá sé/sí saor ar bhannaí

source: The Criminal Justice Act, 1999
ga: An tAcht um Dhlí Coiriúil, 1999

source: This Act deals with the protection of witnesses, including victims, who may have to give evidence in court
ga: Cosaint finnéithe, íobartaigh san áireamh, a bhfuil gá dóibh fianaise a thabhairt sa chúirt atá i gceist leis an Acht seo

source: It allows witnesses who are in fear or subject to intimidation to give evidence by a live television link:
ga: Tugann sé cead do fhinnéithe a bhfuil eagla orthu nó a bhfuil imeaglú dhá imirt orthu fianaise a thabhairt tríd nasc teilifíse beo chuig an gcúirt

source: It creates some new offences, including intimidation of a witness, a jury member or any person helping the Gardai with a criminal investigation
ga: Tá coireann nua cruthaithe ag an Acht freisin, ina measc imeaglú finné, ball den ghiúré nó aon duine atá ag tabhairt cúnaimh do na Gardaí agus iad ag déanamh scrúduithe ar chás coiriúil

source: The penalty is up to 10 years imprisonment
ga: Tá pionós de suas le 10 mbliana sa phríosún ag dul leis

source: The Criminal Law (Human Trafficking) Act 2008
ga: An tAcht um Dhlí Coiriúil (Gáinneáil ar Dhaoine) 2008

source: This Act makes it an offence to traffick in adults or children for the purpose of their sexual or labour exploitation or the removal of their organs
ga: Faoin tAcht seo is cion atá i gceist le gáinneáil a dhéanamh ar dhaoine nó leanaí ar mhaithe le teacht i dtír gnéasach nó oibre a dhéanamh orthu, nó chun a gcuid orgán a thógáil

source: In addition, it makes it an offence to sell or purchase (or offer to sell or purchase) any person for any purpose
ga: Ina theannta sin, is cion atá ann duine ar bith a dhíol nó a cheannach (nó tairiscint a dhéanamh chun duine a dhíol nó a cheannach) ar chúis ar bith

source: It is also an offence to solicit or importune a trafficked person for the purpose of prostitution
ga: Is cion atá ann duine a ndearnadh gáinneáil air/uirthi a shireadh nó a dhianshireadh ar mhaithe le striapachas

source: The Criminal Law (Defence and the Dwelling) Act 2011
ga: An tAcht um Dhlí Coiriúil (Cosaint agus an Cónaithe) 2011

source: This law provides that people are entitled to use reasonable force in defence of people and property if they believe that an intruder has entered their dwelling to commit a criminal act
ga: Forálann an dlí go bhfuil daoine atá i dteideal úsáid a bhaint as forneart réasúnach a chosaint ar dhaoine agus maoin má chreideann siad go bhfuil a n-áit chónaithe ionraitheora isteach chun tiomantas gníomh coiriúil

source: For information about the legislation relating to victims, please contact the Department of Justice and Equality. Information is also available in the Victims and the law section of the Victims Charter (pdf). Where to apply Department of Justice and Equality 94 St
ga: Is féidir tuilleadh eolais maidir leis an reachtaíocht a bhaineann le íobartaigh choireanna a fháil ón Roinn Dlí agus Cirt agus Comhionannais
